/*************************************************************************
  @File Name: 指针.c
  @Author: jesen
  @Mail:xie_stacol@163.com
  @Created Time: 2021年04月27日 星期二 17时05分05秒
 ************************************************************************/

#include <stdio.h>

int main(int argv, char* argc[]){

	// 指针是一种数据类型，只能保存地址
	
	/* 指针大小：
	 * 1.32位编译器用32位大小保存地址，即4字节
	 * 2.64位编译器用64位保存，8字节
	 *
	 * */


	int *p;
	int a = 10;
	// 指针指向谁，就把谁的地址赋值给指针
	p = &a;
	// %p是16进制打印
	printf("16 p, %p\n",p);
	printf("10 p, %d\n",p);

	*p = 100;
	printf("*p 就是 a,他们值是：%d, %d\n", *p, a);
	// *p 等价于*(p+0), 同时等价于p[0];只要是指针都可以用[]
	printf("p[0] = %d\n", p[0]);
	
	return 0;

}
