/*************************************************************************
  @File Name: 指针数组.c
  @Author: jesen
  @Mail:xie_stacol@163.com
  @Created Time: 2021年04月28日 星期三 12时16分37秒
 ************************************************************************/

#include <stdio.h>

int main(int argv, char* argc[]){

	/* 指针数组：由指针组成的数组，每个元素都是指针
	 *
	 *
	 * */

	int a[3] = {0,1,2};
	int *p[3];
	p[0] = &a[0];
	p[0] = a; // 等价

	p[1] = &a[1];
	p[1] = a + 1; // 等价
	// or
	int i = 0;
	for(i = 0; i <3; i++){
		p[i] = a +i;
	}

	for(i=0; i < 3; i++){
		printf("item = %d ",*( p[i]));
	}

	return 0;
} 
