/*************************************************************************
  @File Name: 相对路径.c
  @Author: jesen
  @Mail:xie_stacol@163.com
  @Created Time: 2021年04月30日 星期五 20时04分29秒
 ************************************************************************/

#include <stdio.h>

/*相对路径：
 * 1.Linux:相对路径相对于可执行程序
 * 2.Vscode:
 *  1)编译同时运行程序，相对于xxx.vcxproj所在路径
 *  2)如果直接运行程序，相对于可执行程序
 * 3.Qt:
 *  1)编译同时运行程序，相对于debug所在路径
 *  2)如果直接运行程序，相对于可执行程序
 *
 * */

int main(int argc, char* argv[])
{

     return 0;
}
